{
  "cyclone": {
    "name": "BARRY",
    "category": "Tropical Storm",
    "current_location": "about 100 miles southwest of the Mouth of the Mississippi River",
    "coordinates": "28.2N, 90.4W",
    "motion": {
      "direction": "WNW",
      "speed": "5 mph"
    },
    "trajectory": "The system is expected to turn northwest later today and then north on Saturday, tracking toward the central Louisiana coast and then up the Mississippi Valley.",
    "expected_landfall_location": "central Louisiana coast near Morgan City",
    "expected_landfall_date": "2019-07-13",
    "hours_to_landfall": "24",
    "hours_to_offshore": "48",
    "hours_of_strike": "12"
  },
  "port": {
    "name": "New Orleans, LA"
  },
  "weather_observation": {
    "within_uncertainty_cone": "Yes",
    "forecast_window": "5",
    "under_watch": "None",
    "under_warning": "Tropical Storm Warning",
    "watch_coast": "Hurricane Watch: Mouth of the Mississippi River to Grand Isle; Intracoastal City to Cameron. Tropical Storm Watch: East of the Mouth of the Pearl River to the Mississippi/Alabama border.",
    "warning_coast": "Tropical Storm Warning: Mouth of the Pearl River to Grand Isle, Lake Pontchartrain and Lake Maurepas (including metropolitan New Orleans), Intracoastal City to Cameron. Storm Surge Warning: Intracoastal City to Biloxi, including Lake Pontchartrain.",
    "impacted_coast": "North-central Gulf Coast from Intracoastal City LA eastward to Biloxi MS, including metropolitan New Orleans and the Mississippi Delta.",
    "expected_closest_date_to_port": "2019-07-13",
    "expected_leaving_port_date": "2019-07-14",
    "closest_wind_data_location": "NEW ORLEANS LA",
    "culmulative_wind_34kt": "61%",
    "culmulative_wind_50kt": "8%",
    "34kt_max": "58%",
    "time_to_34kt_max": "36",
    "time_to_34kt_non_zero": "0",
    "time_to_50kt_max": "36",
    "gale_probability": {
      "in 12h": "7%",
      "in 24h": "38%",
      "in 48h": "61%",
      "in 72h": "61%",
      "in 96h": "61%"
    },
    "first_hazard": "Start of storm surge",
    "rain_fall_above_4_inch": "Yes",
    "storm_surge_above_3_feet": "Yes",
    "wind": "Tropical-storm-force winds (39–73 mph) are likely in the New Orleans area Friday night through Saturday; brief hurricane-force gusts are possible if Barry reaches hurricane strength before landfall.",
    "storm_surge": "3–5 ft of inundation is possible in Lake Pontchartrain and adjacent tidal waterways, including the New Orleans metro area.",
    "rainfall": "10–20 inches with locally higher totals could fall across southeast Louisiana, producing life-threatening flash flooding and river flooding in and around New Orleans.",
    "other_hazards": "A few tornadoes are possible in outer rain bands Friday afternoon through Saturday."
  }
}