{
  "cyclone": {
    "name": "DORIAN",
    "category": "Category 3",
    "current_location": "about 40 mi (70 km) NE of Freeport, Grand Bahama Island and 110 mi (175 km) ENE of West Palm Beach, Florida",
    "coordinates": "27.1N, 78.4W",
    "motion": {
      "direction": "NW",
      "speed": "1 mph"
    },
    "trajectory": "Expected to drift northwest today, then turn north near the Florida/Georgia coast and accelerate north-northeast parallel to the U.S. East Coast, passing just offshore of the Mid-Atlantic states before moving toward Atlantic Canada",
    "expected_landfall_location": "near or over the Outer Banks of North Carolina",
    "expected_landfall_date": "2019-09-05",
    "hours_to_landfall": "60",
    "hours_to_offshore": "96",
    "hours_of_strike": "12"
  },
  "port": {
    "name": "South Jersey Port Corp, NJ"
  },
  "weather_observation": {
    "within_uncertainty_cone": "Yes",
    "forecast_window": "5",
    "under_watch": "None",
    "under_warning": "None",
    "watch_coast": "Hurricane Watch from north of Deerfield Beach FL to Jupiter Inlet FL and from north of Ponte Vedra Beach FL to South Santee River SC; Tropical Storm Watch north of Golden Beach FL to Deerfield Beach FL and Lake Okeechobee",
    "warning_coast": "Hurricane Warning Jupiter Inlet FL to Ponte Vedra Beach FL; Tropical Storm Warning north of Deerfield Beach FL to Altamaha Sound GA; Storm Surge Warning Lantana FL to Savannah River",
    "impacted_coast": "Florida east coast, Georgia, South Carolina, North Carolina, and portions of the Mid-Atlantic and southern New England coasts (including New Jersey) over the next 3–5 days",
    "expected_closest_date_to_port": "2019-09-06",
    "expected_leaving_port_date": "2019-09-07",
    "closest_wind_data_location": "PHILADELPHIA",
    "culmulative_wind_34kt": "7%",
    "culmulative_wind_50kt": "0%",
    "34kt_max": "7%",
    "time_to_34kt_max": "120",
    "time_to_34kt_non_zero": "72",
    "time_to_50kt_max": "N/A",
    "gale_probability": {
      "in 12h": "0%",
      "in 24h": "0%",
      "in 48h": "0%",
      "in 72h": "1%",
      "in 96h": "6%"
    },
    "first_hazard": "Arrival of tropical storm-force winds",
    "rain_fall_above_4_inch": "No",
    "storm_surge_above_3_feet": "No",
    "wind": "Low chance (≤7%) of sustained tropical-storm-force winds by late Friday into early Saturday; occasional gusty northeasterlies likely as the storm passes offshore.",
    "storm_surge": "None anticipated for the Delaware River terminals; surge threat confined to the Southeast coast well south of New Jersey.",
    "rainfall": "Periods of rain associated with outer rain-bands could total 1–2 inches Friday–Saturday, below major-flood threshold.",
    "other_hazards": "Rough seas and hazardous marine conditions could disrupt vessel scheduling along the New Jersey approaches."
  }
}