{
  "cyclone": {
    "name": "DORIAN",
    "category": "Category 4",
    "current_location": "about 25 mi NE of Freeport, Grand Bahama Island and 105 mi E of West Palm Beach, Florida",
    "coordinates": "26.8N, 78.4W",
    "motion": {
      "direction": "Stationary (expected to resume WNW then turn NW–NE)",
      "speed": "0 mph"
    },
    "trajectory": "Expected to drift WNW overnight, turn northwest Tuesday, then curve northeast Wednesday night and move parallel to the Southeast U.S. coastline before accelerating northeastward well offshore of the Mid-Atlantic and New England coasts",
    "expected_landfall_location": "possible close coastal pass or brush near the South or North Carolina coastline (no direct landfall forecast for New Jersey)",
    "expected_landfall_date": "2019-09-05",
    "hours_to_landfall": "72",
    "hours_to_offshore": "96",
    "hours_of_strike": "12"
  },
  "port": {
    "name": "South Jersey Port Corp, NJ"
  },
  "weather_observation": {
    "within_uncertainty_cone": "No",
    "forecast_window": "5",
    "under_watch": "None",
    "under_warning": "None",
    "watch_coast": "Hurricane and Tropical Storm watches extend from north of Deerfield Beach FL to South Santee River SC.",
    "warning_coast": "Hurricane and Storm-Surge warnings from Jupiter Inlet FL to Ponte Vedra Beach FL and Lantana FL to Altamaha Sound GA.",
    "impacted_coast": "Florida east coast through the Georgia and Carolina coasts; Mid-Atlantic coast (including New Jersey) mainly affected by peripheral winds and surf late week.",
    "expected_closest_date_to_port": "2019-09-06",
    "expected_leaving_port_date": "2019-09-07",
    "closest_wind_data_location": "PHILADELPHIA PA",
    "culmulative_wind_34kt": "7%",
    "culmulative_wind_50kt": "0%",
    "34kt_max": "7%",
    "time_to_34kt_max": "120",
    "time_to_34kt_non_zero": "96",
    "time_to_50kt_max": "",
    "gale_probability": {
      "in 12h": "0%",
      "in 24h": "0%",
      "in 48h": "0%",
      "in 72h": "0%",
      "in 96h": "6%"
    },
    "first_hazard": "Arrival of tropical storm-force winds",
    "rain_fall_above_4_inch": "No",
    "storm_surge_above_3_feet": "No",
    "wind": "Low (≤10%) chance of sustained tropical-storm-force winds late Friday into Saturday; occasional gusts possible, mainly along the immediate Jersey shore.",
    "storm_surge": "None expected; water rise confined well south of New Jersey.",
    "rainfall": "Bands of light to moderate rain possible; totals generally under 2 inches.",
    "other_hazards": "High surf and dangerous rip currents along the New Jersey coastline beginning late Thursday and persisting through Saturday."
  }
}