{
  "cyclone": {
    "name": "DORIAN",
    "category": "Category 2",
    "current_location": "about 110 miles east of Cape Canaveral, Florida",
    "coordinates": "28.1N, 78.8W",
    "motion": {
      "direction": "NW",
      "speed": "6 mph"
    },
    "trajectory": "The hurricane is moving northwest tonight, then is forecast to turn north and parallel the Florida east coast before heading toward the coasts of Georgia and the Carolinas.",
    "expected_landfall_location": "South- or North-Carolina coast (near the SC/NC border)",
    "expected_landfall_date": "2019-09-05",
    "hours_to_landfall": "48",
    "hours_to_offshore": "18",
    "hours_of_strike": "6"
  },
  "port": {
    "name": "Port Everglades, FL"
  },
  "weather_observation": {
    "within_uncertainty_cone": "No",
    "forecast_window": "5",
    "under_watch": "None",
    "under_warning": "None",
    "watch_coast": "Hurricane Watch north of Ponte Vedra Beach FL to Savannah River GA and north of Surf City NC to the NC/VA border; Tropical Storm Watch Chesapeake Bay south of Smith Point; Storm Surge Watch north of Surf City NC to Duck NC including sounds and rivers.",
    "warning_coast": "Hurricane Warning Sebastian Inlet FL to Ponte Vedra Beach FL and from north of Savannah River to Surf City NC; Tropical Storm Warning Jupiter Inlet FL to Sebastian Inlet FL and north of Ponte Vedra Beach FL to Savannah River GA; Storm Surge Warning Jupiter Inlet FL to Surf City NC.",
    "impacted_coast": "Southeastern U.S. coast from just north of West Palm Beach FL through Georgia, South Carolina and North Carolina.",
    "expected_closest_date_to_port": "2019-09-03",
    "expected_leaving_port_date": "2019-09-04",
    "closest_wind_data_location": "FT LAUDERDALE",
    "culmulative_wind_34kt": "11%",
    "culmulative_wind_50kt": "<3%",
    "34kt_max": "11%",
    "time_to_34kt_max": "36",
    "time_to_34kt_non_zero": "0",
    "time_to_50kt_max": "N/A",
    "gale_probability": {
      "in 12h": "5%",
      "in 24h": "9%",
      "in 48h": "11%",
      "in 72h": "11%",
      "in 96h": "11%"
    },
    "first_hazard": "Start of heavy rainfall",
    "rain_fall_above_4_inch": "No",
    "storm_surge_above_3_feet": "No",
    "wind": "Outer rainbands could bring occasional tropical-storm-force gusts (30–40 mph) but sustained gale conditions are unlikely.",
    "storm_surge": "Minor surge of 1–2 ft possible along exposed Broward County beaches; significant inundation not expected at the port.",
    "rainfall": "1–3 inches of rainfall possible in squalls; localized heavier pockets in outer bands.",
    "other_hazards": "Hazardous surf and life-threatening rip currents along the southeast Florida beaches could disrupt small-craft and pilot-boat operations."
  }
}