{
  "cyclone": {
    "name": "IAN",
    "category": "Category 1",
    "current_location": "about 90 miles SW of Grand Cayman",
    "coordinates": "18.2N, 82.0W",
    "motion": {
      "direction": "NW",
      "speed": "14 mph"
    },
    "trajectory": "Ian is tracking northwest toward western Cuba, then turning north across the southeastern Gulf of Mexico and is forecast to approach the west coast of Florida mid-week, before crossing the peninsula and moving into the Atlantic late week.",
    "expected_landfall_location": "west coast of Florida near Tampa Bay",
    "expected_landfall_date": "2022-09-28",
    "hours_to_landfall": "60",
    "hours_to_offshore": "36",
    "hours_of_strike": "24"
  },
  "port": {
    "name": "Port Everglades, FL"
  },
  "weather_observation": {
    "within_uncertainty_cone": "No",
    "forecast_window": "5",
    "under_watch": "None",
    "under_warning": "None",
    "watch_coast": "Tropical Storm Watch from Englewood southward to Chokoloskee on Florida’s southwest coast",
    "warning_coast": "Tropical Storm Warning for the Lower Florida Keys from Seven Mile Bridge westward to Key West and Dry Tortugas; Storm-Surge Watch Anclote River southward to Card Sound Bridge, including Florida Bay",
    "impacted_coast": "Entire west coast of Florida from Anclote River to Bonita Beach (highest surge 5–8 ft) and much of the Florida peninsula for heavy rain and wind",
    "expected_closest_date_to_port": "2022-09-28",
    "expected_leaving_port_date": "2022-09-29",
    "closest_wind_data_location": "FT LAUDERDALE FL",
    "culmulative_wind_34kt": "42%",
    "culmulative_wind_50kt": "8%",
    "34kt_max": "19%",
    "time_to_34kt_max": "48",
    "time_to_34kt_non_zero": "24",
    "time_to_50kt_max": "48",
    "gale_probability": {
      "in 12h": "0%",
      "in 24h": "0%",
      "in 48h": "14%",
      "in 72h": "33%",
      "in 96h": "40%"
    },
    "first_hazard": "Arrival of tropical storm-force winds",
    "rain_fall_above_4_inch": "Yes",
    "storm_surge_above_3_feet": "No",
    "wind": "Tropical-storm-force winds (sustained ≥39 mph) possible Tuesday night through Wednesday with a peak 1-in-5 chance; brief gusts could exceed 50 mph in squalls.",
    "storm_surge": "No significant storm-surge threat is indicated for the Atlantic side near Port Everglades; highest surge values remain along Florida’s west coast and Florida Bay.",
    "rainfall": "3–6 inches of rain possible across southeast Florida Tuesday–Thursday, producing localized flash-flooding in low-lying terminal and access-road areas.",
    "other_hazards": "A few tornadoes are possible Tuesday into Wednesday across the southern and central Florida Peninsula, including the Port Everglades area; high surf and dangerous rip currents expected along Atlantic beaches."
  }
}