{
  "cyclone": {
    "name": "IAN",
    "category": "Category 2",
    "current_location": "about 155 miles SE of the western tip of Cuba",
    "coordinates": "20.3N, 83.2W",
    "motion": {
      "direction": "NNW",
      "speed": "13 mph"
    },
    "trajectory": "Forecast to turn north on Tuesday, then north-northeast, becoming a major hurricane over the east-central Gulf, making first landfall along Florida’s west coast Wednesday night–Thursday, then moving inland across the Southeast toward the Carolinas by Friday–Saturday.",
    "expected_landfall_location": "Florida west coast (around the Tampa Bay–Cedar Key region)",
    "expected_landfall_date": "2022-09-29",
    "hours_to_landfall": "60",
    "hours_to_offshore": "≈144",
    "hours_of_strike": "≈12"
  },
  "port": {
    "name": "Wilmington, NC"
  },
  "weather_observation": {
    "within_uncertainty_cone": "Yes",
    "forecast_window": "5",
    "under_watch": "None",
    "under_warning": "None",
    "watch_coast": "Altamaha Sound GA to Flagler/Volusia County Line FL (Storm-Surge Watch), Suwannee River FL to Indian Pass FL and Jupiter Inlet FL to Altamaha Sound GA (Tropical-Storm Watch).",
    "warning_coast": "Cuban provinces of Isla de Juventud, Pinar del Rio, Artemisa; Englewood FL to Anclote River FL including Tampa Bay (Hurricane Warning); Dry Tortugas FL (Hurricane Warning); Anclote River southward to Flamingo FL including Tampa Bay (Storm-Surge Warning).",
    "impacted_coast": "Entire eastern Gulf Coast of FL, then the Georgia and South Carolina coasts, with the cone extending into coastal North Carolina including Cape Fear region.",
    "expected_closest_date_to_port": "2022-10-01",
    "expected_leaving_port_date": "2022-10-02",
    "closest_wind_data_location": "WILMINGTON NC",
    "culmulative_wind_34kt": "8%",
    "culmulative_wind_50kt": "0%",
    "34kt_max": "5%",
    "time_to_34kt_max": "120",
    "time_to_34kt_non_zero": "96",
    "time_to_50kt_max": "N/A",
    "gale_probability": {
      "in 12h": "0%",
      "in 24h": "0%",
      "in 48h": "0%",
      "in 72h": "0%",
      "in 96h": "3%"
    },
    "first_hazard": "Start of heavy rainfall",
    "rain_fall_above_4_inch": "Possible (rainfall bands could approach or exceed 4 inches late week)",
    "storm_surge_above_3_feet": "Unlikely",
    "wind": "Low (≤8% chance of sustained tropical-storm-force winds, breezy conditions possible Friday–Saturday)",
    "storm_surge": "None expected above minor tidal departures; primary surge focus remains south of Cape Fear.",
    "rainfall": "Periods of heavy rain Friday-Saturday as remnant core tracks toward the Carolinas; localized flooding possible.",
    "other_hazards": "Elevated surf and rip currents late week; small risk of brief tornadoes in outer rain-bands."
  }
}