{
  "cyclone": {
    "name": "IDA",
    "category": "Category 1",
    "current_location": "about 45 mi NW of the Isle of Youth, or 90 mi SW of Havana Cuba",
    "coordinates": "22.1N, 83.2W",
    "motion": {
      "direction": "NW",
      "speed": "15 mph"
    },
    "trajectory": "tracking northwest across the southeastern and central Gulf of Mexico toward the northern Gulf Coast, with the core aimed at southeast Louisiana",
    "expected_landfall_location": "southeast Louisiana coast – between Intracoastal City and the Mouth of the Mississippi River (near Morgan City/Buras area)",
    "expected_landfall_date": "2021-08-29",
    "hours_to_landfall": "48",
    "hours_to_offshore": "24",
    "hours_of_strike": "18"
  },
  "port": {
    "name": "South Louisiana, LA, Port of"
  },
  "weather_observation": {
    "within_uncertainty_cone": "Yes",
    "forecast_window": "5",
    "under_watch": "None",
    "under_warning": "Hurricane Warning (also under Storm Surge Warning)",
    "watch_coast": "Hurricane Watch from Cameron, LA to west of Intracoastal City, and from the Mouth of the Pearl River to the MS/AL border; Storm Surge Watch Sabine Pass to Rockefeller Wildlife Refuge and Mobile Bay",
    "warning_coast": "Hurricane Warning from Intracoastal City, LA to the Mouth of the Pearl River including Lake Pontchartrain, Lake Maurepas, and Metropolitan New Orleans; Storm Surge Warning east of Rockefeller Wildlife Refuge, LA to the MS/AL border including Vermilion Bay, Lake Borgne, Lake Pontchartrain and Lake Maurepas",
    "impacted_coast": "Entire Louisiana coastline, especially southeast Louisiana, plus Mississippi and Alabama coasts",
    "expected_closest_date_to_port": "2021-08-29",
    "expected_leaving_port_date": "2021-08-30",
    "closest_wind_data_location": "NEW ORLEANS LA",
    "culmulative_wind_34kt": "79%",
    "culmulative_wind_50kt": "49%",
    "34kt_max": "74%",
    "time_to_34kt_max": "72",
    "time_to_34kt_non_zero": "36",
    "time_to_50kt_max": "72",
    "gale_probability": {
      "in 12h": "0%",
      "in 24h": "0%",
      "in 48h": "28%",
      "in 72h": "74%",
      "in 96h": "79%"
    },
    "first_hazard": "Arrival of tropical storm-force winds",
    "rain_fall_above_4_inch": "Yes",
    "storm_surge_above_3_feet": "Yes",
    "wind": "Hurricane-force winds (potentially 90–120 mph) likely late Sunday as Ida makes landfall; tropical-storm-force winds could reach the port late Saturday night.",
    "storm_surge": "Life-threatening storm surge 7–11 ft forecast for Lake Pontchartrain and 10–15 ft from Morgan City to the Mouth of the Mississippi River, pushing water well upriver toward the Port of South Louisiana.",
    "rainfall": "8–16 inches with isolated 20 inches possible, producing considerable flash and river flooding along the Mississippi River corridor where the port is located.",
    "other_hazards": "Dangerous waves on the lower Mississippi River, very rough inland waterways, possible tornadoes in outer rain bands, prolonged power outages, and significant disruption to ground transportation serving the port."
  }
}