{
  "cyclone": {
    "name": "IDA",
    "category": "Category 1",
    "current_location": "about 45 mi NW of the Isle of Youth and 90 mi SW of Havana, Cuba",
    "coordinates": "22.1N, 83.2W",
    "motion": {
      "direction": "NW",
      "speed": "15 mph"
    },
    "trajectory": "moving northwest across the southeastern and central Gulf of Mexico, then turning north toward the southeast Louisiana coast – tracking directly toward the New Orleans area",
    "expected_landfall_location": "southeastern Louisiana coast (likely south of New Orleans between Intracoastal City and the Mouth of the Mississippi River)",
    "expected_landfall_date": "2021-08-29",
    "hours_to_landfall": "48",
    "hours_to_offshore": "48",
    "hours_of_strike": "24"
  },
  "port": {
    "name": "New Orleans, LA"
  },
  "weather_observation": {
    "within_uncertainty_cone": "Yes",
    "forecast_window": "5",
    "under_watch": "None",
    "under_warning": "Hurricane Warning",
    "watch_coast": "Sabine Pass TX to Rockefeller Wildlife Refuge LA (Storm Surge Watch); Cameron LA to west of Intracoastal City LA and Mouth of Pearl River to MS/AL border (Hurricane Watch)",
    "warning_coast": "Storm Surge Warning east of Rockefeller Wildlife Refuge LA to the MS/AL border, including Lake Borgne, Lake Pontchartrain and Lake Maurepas; Hurricane Warning Intracoastal City LA to Mouth of Pearl River, including Lake Pontchartrain, Lake Maurepas, and Metropolitan New Orleans",
    "impacted_coast": "Northern Gulf Coast from southeast Louisiana through coastal Mississippi and Alabama",
    "expected_closest_date_to_port": "2021-08-29",
    "expected_leaving_port_date": "2021-08-30",
    "closest_wind_data_location": "NEW ORLEANS LA",
    "culmulative_wind_34kt": "79%",
    "culmulative_wind_50kt": "49%",
    "34kt_max": "46%",
    "time_to_34kt_max": "72",
    "time_to_34kt_non_zero": "36",
    "time_to_50kt_max": "72",
    "gale_probability": {
      "in 12h": "0%",
      "in 24h": "0%",
      "in 48h": "28%",
      "in 72h": "74%",
      "in 96h": "79%"
    },
    "first_hazard": "Arrival of tropical storm-force winds",
    "rain_fall_above_4_inch": "Yes",
    "storm_surge_above_3_feet": "Yes",
    "wind": "Hurricane-force winds (possibly 100+ mph if Ida strengthens to a major hurricane) likely Sunday with tropical-storm-force winds beginning late Saturday night.",
    "storm_surge": "4–7 ft possible in Lake Pontchartrain and along the southeast Louisiana coast near and east of the expected landfall point.",
    "rainfall": "8–16 inches with isolated totals to 20 inches, producing considerable flash and urban flooding.",
    "other_hazards": "Isolated tornadoes in outer rainbands; life-threatening surf and rip currents; prolonged power outages and port infrastructure disruption."
  }
}