{
  "cyclone": {
    "name": "IDALIA",
    "category": "Category 1",
    "current_location": "about 85 miles north of the western tip of Cuba and 370 miles south-southwest of Tampa, Florida",
    "coordinates": "23.1N, 85.0W",
    "motion": {
      "direction": "N",
      "speed": "14 mph"
    },
    "trajectory": "moving north today, then accelerating north-northeast across the eastern Gulf toward Florida’s Big Bend on Wednesday and onward across southeast Georgia and the Carolinas, emerging offshore near the North Carolina–Virginia border late Thursday night",
    "expected_landfall_location": "Florida Big Bend near or just south of Cedar Key",
    "expected_landfall_date": "2023-08-30",
    "hours_to_landfall": "24",
    "hours_to_offshore": "68",
    "hours_of_strike": "12"
  },
  "port": {
    "name": "Virginia, VA, Port of"
  },
  "weather_observation": {
    "within_uncertainty_cone": "Yes",
    "forecast_window": "5",
    "under_watch": "None",
    "under_warning": "None",
    "watch_coast": "Storm Surge and Tropical Storm Watches currently extend only from the mouth of the St. Mary’s River, FL to South Santee River, SC – no watches yet north of Cape Fear.",
    "warning_coast": "Hurricane and Storm-Surge Warnings confined to Florida Gulf coast (Englewood to Indian Pass including Tampa Bay).",
    "impacted_coast": "Florida Gulf coast (Big Bend), southeast Georgia, the South and North Carolina coasts, with lesser effects potentially reaching the southern Chesapeake Bay and Virginia Capes.",
    "expected_closest_date_to_port": "2023-09-01",
    "expected_leaving_port_date": "2023-09-01",
    "closest_wind_data_location": "NORFOLK VA",
    "culmulative_wind_34kt": "3%",
    "culmulative_wind_50kt": "<1%",
    "34kt_max": "3%",
    "time_to_34kt_max": "96",
    "time_to_34kt_non_zero": "72",
    "time_to_50kt_max": "0",
    "gale_probability": {
      "in 12h": "<1%",
      "in 24h": "<1%",
      "in 48h": "<1%",
      "in 72h": "2%",
      "in 96h": "1%"
    },
    "first_hazard": "Start of heavy rainfall",
    "rain_fall_above_4_inch": "No",
    "storm_surge_above_3_feet": "No",
    "wind": "Low (≤3%) chance of sustained tropical-storm-force winds; any winds above gale force would be brief late Thursday night or early Friday while the center passes offshore.",
    "storm_surge": "At this time guidance keeps surge below 3 ft along the lower Chesapeake and Virginia Capes; only minor coastal inundation possible with persistent onshore flow.",
    "rainfall": "1–3 inches of rain possible Thursday night–Friday, locally higher in heavy bands, enough to cause ponding and minor terminal/yard flooding.",
    "other_hazards": "Dangerous rip currents and rough seas beginning Thursday; potential short-notice tornado threat in outer rainbands as the center nears the North Carolina-Virginia border."
  }
}