{
  "cyclone": {
    "name": "IDALIA",
    "category": "Tropical Storm",
    "current_location": "about 125 miles south of the western tip of Cuba",
    "coordinates": "20.1N, 85.2W",
    "motion": {
      "direction": "N",
      "speed": "7 mph"
    },
    "trajectory": "Moving north, then accelerating north-northeast across the eastern Gulf of Mexico toward Florida’s Big Bend, forecast to cross the southeast U.S. (GA/SC) and move offshore near the Carolina coast before heading into the western Atlantic toward Bermuda",
    "expected_landfall_location": "Florida Big Bend coast (between Cedar Key and Tallahassee, FL)",
    "expected_landfall_date": "2023-08-30",
    "hours_to_landfall": "48",
    "hours_to_offshore": "60",
    "hours_of_strike": "12"
  },
  "port": {
    "name": "Wilmington, NC"
  },
  "weather_observation": {
    "within_uncertainty_cone": "Yes",
    "forecast_window": "5",
    "under_watch": "None",
    "under_warning": "None",
    "watch_coast": "Hurricane Watch: Englewood to Indian Pass, FL; Tropical-storm Watch: South of Englewood to Chokoloskee, FL and Lower Florida Keys west of Seven-Mile Bridge; Storm-surge Watch: Chokoloskee to Indian Pass, FL including Tampa Bay",
    "warning_coast": "Hurricane Warning: Pinar del Rio, Cuba; Tropical-storm Warning: Yucatan Peninsula (Tulum to Rio Lagartos), Cozumel, Isle of Youth, Dry Tortugas, FL",
    "impacted_coast": "Florida Gulf coast, Georgia and South Carolina Low-country, and the coast of North and South Carolina (including Cape Fear to Cape Hatteras)",
    "expected_closest_date_to_port": "2023-08-31",
    "expected_leaving_port_date": "2023-09-01",
    "closest_wind_data_location": "WILMINGTON NC",
    "culmulative_wind_34kt": "16%",
    "culmulative_wind_50kt": "<3%",
    "34kt_max": "16%",
    "time_to_34kt_max": "120",
    "time_to_34kt_non_zero": "72",
    "time_to_50kt_max": "",
    "gale_probability": {
      "in 12h": "0%",
      "in 24h": "0%",
      "in 48h": "0%",
      "in 72h": "9%",
      "in 96h": "15%"
    },
    "first_hazard": "Start of heavy rainfall",
    "rain_fall_above_4_inch": "Yes",
    "storm_surge_above_3_feet": "No",
    "wind": "Tropical-storm-force gusts (35–45 mph) possible late Thursday as the center passes southeast of Wilmington; probability of sustained 34 kt winds is low (≤16%, peaks around 96–120 h).",
    "storm_surge": "Minor surge of 1–3 ft possible along the lower Cape Fear River and adjacent beaches if the center tracks close to shore.",
    "rainfall": "4–8 inches of rain possible Wednesday night into Thursday with pockets of flash flooding in the Wilmington area.",
    "other_hazards": "High surf, dangerous rip currents, and localized beach erosion beginning mid-week."
  }
}