{
  "cyclone": {
    "name": "IRMA",
    "category": "Category 3",
    "current_location": "about 65 mi E of Varadero, Cuba and 145 mi SE of Key West, Florida",
    "coordinates": "23.1N, 80.2W",
    "motion": {
      "direction": "W",
      "speed": "9 mph"
    },
    "trajectory": "Irma is expected to begin turning northwest later today, then move north-northwest Sunday, skirting the lower Florida Keys, riding up the southwest coast of Florida, and then moving inland across the Florida peninsula toward Georgia.",
    "expected_landfall_location": "Florida Keys (near Key West) with a secondary coastal encounter near Naples–Marco Island, FL",
    "expected_landfall_date": "2017-09-10",
    "hours_to_landfall": "18",
    "hours_to_offshore": "24",
    "hours_of_strike": "12"
  },
  "port": {
    "name": "Manatee County Port, FL"
  },
  "weather_observation": {
    "within_uncertainty_cone": "Yes",
    "forecast_window": "5",
    "under_watch": "None",
    "under_warning": "Hurricane Warning",
    "watch_coast": "North of Fernandina Beach to Edisto Beach, and west of the Aucilla River to Indian Pass (hurricane watch); storm-surge watch north of Volusia/Brevard County line to Isle of Palms, SC and north of Suwannee River to Ochlockonee River",
    "warning_coast": "Fernandina Beach southward around the entire Florida peninsula to the Aucilla River including Tampa Bay and the Florida Keys (hurricane warning); storm-surge warning Volusia/Brevard County line southward around the peninsula to Suwannee River including Tampa Bay",
    "impacted_coast": "Entire Florida peninsula and Keys, especially southwest and west-central coasts including Tampa Bay to Cedar Key",
    "expected_closest_date_to_port": "2017-09-11",
    "expected_leaving_port_date": "2017-09-11",
    "closest_wind_data_location": "TAMPA FL",
    "culmulative_wind_34kt": "98%",
    "culmulative_wind_50kt": "87%",
    "34kt_max": "57%",
    "time_to_34kt_max": "36",
    "time_to_34kt_non_zero": "12",
    "time_to_50kt_max": "48",
    "gale_probability": {
      "in 12h": "2%",
      "in 24h": "9%",
      "in 48h": "98%",
      "in 72h": "98%",
      "in 96h": "98%"
    },
    "first_hazard": "Arrival of tropical storm-force winds",
    "rain_fall_above_4_inch": "Yes",
    "storm_surge_above_3_feet": "Yes",
    "wind": "Very strong winds are likely: tropical-storm force (gale) winds are almost certain (98% chance) and hurricane-force gusts are probable (64-kt probability 68% for nearby Tampa). Peak sustained winds at the port late Sunday night into Monday morning could reach 60–80 mph with higher gusts.",
    "storm_surge": "NHC surge forecast calls for 5–8 ft of inundation above ground from Ana Maria Island northward through Tampa Bay, which includes Port Manatee.",
    "rainfall": "8–15 inches of rain with localized totals to 20 inches are possible over west-central Florida, bringing a significant flash-flood threat.",
    "other_hazards": "Isolated tornadoes in outer rain-bands, dangerous surf and rip currents in Tampa Bay and adjacent Gulf waters, plus prolonged port closure due to debris and high water."
  }
}