{
  "cyclone": {
    "name": "IRMA",
    "category": "Category 5",
    "current_location": "about 20 miles north of Great Inagua Island",
    "coordinates": "21.5N, 73.3W",
    "motion": {
      "direction": "WNW",
      "speed": "16 mph"
    },
    "trajectory": "Continuing WNW, then turning northwest late Saturday and tracking toward the Florida Keys and the Florida peninsula",
    "expected_landfall_location": "Florida Keys / extreme South Florida",
    "expected_landfall_date": "2017-09-10",
    "hours_to_landfall": "66",
    "hours_to_offshore": "24",
    "hours_of_strike": "12"
  },
  "port": {
    "name": "Canaveral Port District, FL"
  },
  "weather_observation": {
    "within_uncertainty_cone": "Yes",
    "forecast_window": "5",
    "under_watch": "None",
    "under_warning": "None",
    "watch_coast": "North of Jupiter Inlet to Sebastian Inlet (Atlantic Coast) and north of Bonita Beach to Anna Maria Island (Gulf Coast) are under Hurricane Watch; Storm Surge Watch extends north of Jupiter Inlet to Sebastian Inlet",
    "warning_coast": "Jupiter Inlet southward around the Florida peninsula to Bonita Beach, including the Florida Keys, are under Hurricane Warning; same reach is under Storm Surge Warning",
    "impacted_coast": "Entire Florida east coast, especially South and Central Florida, including Canaveral area, with effects extending northward into Georgia and the Carolinas",
    "expected_closest_date_to_port": "2017-09-10",
    "expected_leaving_port_date": "2017-09-11",
    "closest_wind_data_location": "COCOA BEACH FL",
    "culmulative_wind_34kt": "88%",
    "culmulative_wind_50kt": "59%",
    "34kt_max": "88%",
    "time_to_34kt_max": "96",
    "time_to_34kt_non_zero": "24",
    "time_to_50kt_max": "96",
    "gale_probability": {
      "in 12h": "0%",
      "in 24h": "1%",
      "in 48h": "5%",
      "in 72h": "71%",
      "in 96h": "88%"
    },
    "first_hazard": "Arrival of tropical storm-force winds",
    "rain_fall_above_4_inch": "Likely",
    "storm_surge_above_3_feet": "Possible",
    "wind": "Tropical-storm-force winds are very likely (88% chance) with a moderate chance (≈20–25%) of hurricane-force gusts as the core passes nearby late Sunday into Monday.",
    "storm_surge": "If Irma hugs or crosses the east-central Florida coast, surge of 3–5 ft above ground level is possible along the Space Coast including Port Canaveral, especially if onshore flow coincides with high tide.",
    "rainfall": "3–6 inches widespread with isolated totals up to 10 inches are forecast for east-central Florida; flash-flood potential exists.",
    "other_hazards": "Very rough seas, dangerous surf and rip currents beginning Saturday; embedded tornadoes in rain bands possible Sunday."
  }
}