{
  "cyclone": {
    "name": "IRMA",
    "category": "Category 3",
    "current_location": "about 65 mi (100 km) E of Varadero, Cuba and 145 mi (235 km) SE of Key West, Florida",
    "coordinates": "23.1N, 80.2W",
    "motion": {
      "direction": "W",
      "speed": "9 mph"
    },
    "trajectory": "Irma is forecast to turn northwest later today and then north-northwest on Sunday, tracking up the Florida Keys early Sunday and paralleling/coming ashore along Florida’s southwest coast before moving inland toward north-central Florida and the southeastern United States.",
    "expected_landfall_location": "Florida Keys (near Key West)",
    "expected_landfall_date": "2017-09-10",
    "hours_to_landfall": "18",
    "hours_to_offshore": "24",
    "hours_of_strike": "18"
  },
  "port": {
    "name": "Jacksonville, FL"
  },
  "weather_observation": {
    "within_uncertainty_cone": "Yes",
    "forecast_window": "5",
    "under_watch": "Storm Surge Watch",
    "under_warning": "Hurricane Warning",
    "watch_coast": "Storm Surge Watch from north of the Volusia/Brevard County line to Isle of Palms, South Carolina; Hurricane Watch north of Fernandina Beach to Edisto Beach, South Carolina",
    "warning_coast": "Hurricane Warning from Fernandina Beach southward around the Florida peninsula to the Aucilla River; Storm Surge Warning from the Volusia/Brevard County line southward around the peninsula to the Suwanee River",
    "impacted_coast": "Entire Florida peninsula, especially the west coast, with significant impacts also expected along the northeast Florida and southeast Georgia coasts including Jacksonville",
    "expected_closest_date_to_port": "2017-09-11",
    "expected_leaving_port_date": "2017-09-12",
    "closest_wind_data_location": "JACKSONVILLE",
    "culmulative_wind_34kt": "87%",
    "culmulative_wind_50kt": "47%",
    "34kt_max": "87%",
    "time_to_34kt_max": "72",
    "time_to_34kt_non_zero": "36",
    "time_to_50kt_max": "48",
    "gale_probability": {
      "in 12h": "0%",
      "in 24h": "0%",
      "in 48h": "71%",
      "in 72h": "87%",
      "in 96h": "87%"
    },
    "first_hazard": "Arrival of tropical storm-force winds",
    "rain_fall_above_4_inch": "Yes",
    "storm_surge_above_3_feet": "Yes",
    "wind": "Tropical-storm-force winds (39–57 mph) are likely at Jacksonville Monday with a 47 % chance of reaching 50 kt (58 mph); brief hurricane-force gusts are possible as the center passes west of the port.",
    "storm_surge": "Onshore flow could push 2–4 ft of surge above ground along the St. Johns River and the Atlantic beaches near Jacksonville, especially around high tide Monday.",
    "rainfall": "8–15 inches of rain with isolated totals near 20 inches could cause flash flooding in the Jacksonville area Monday into early Tuesday.",
    "other_hazards": "Isolated tornadoes in outer rain-bands and dangerous surf/rip currents along the northeast Florida coast."
  }
}