{
  "cyclone": {
    "name": "IRMA",
    "category": "Category 3",
    "current_location": "lingering over the north coast of Cuba",
    "coordinates": "23.1N, 80.2W",
    "motion": {
      "direction": "W",
      "speed": "9 mph"
    },
    "trajectory": "expected to turn northwest later today and then north-northwest on Sunday, tracking up the Florida peninsula and then into Georgia/Tennessee",
    "expected_landfall_location": "Florida Keys during the pre-dawn hours of 2017-09-10, then a second landfall along the southwest coast of Florida Sunday afternoon",
    "expected_landfall_date": "2017-09-10",
    "hours_to_landfall": "18",
    "hours_to_offshore": "≈48",
    "hours_of_strike": "≈24"
  },
  "port": {
    "name": "Canaveral Port District, FL"
  },
  "weather_observation": {
    "within_uncertainty_cone": "Yes",
    "forecast_window": "5",
    "under_watch": "Storm Surge Watch (north of port), Hurricane Watch (north of Fernandina Beach), but PORT itself is in warning area",
    "under_warning": "Hurricane Warning and Storm Surge Warning",
    "watch_coast": "Storm Surge Watch from north of the Volusia/Brevard County line to Isle of Palms, SC",
    "warning_coast": "Hurricane Warning from Fernandina Beach southward around the Florida peninsula to the Aucilla River; Storm Surge Warning from the Volusia/Brevard County line southward around the peninsula to the Suwanee River",
    "impacted_coast": "Entire Florida east coast south of Fernandina Beach, including Brevard County and Port Canaveral; strongest core projected for the Keys and west coast but dangerous conditions extend well outward",
    "expected_closest_date_to_port": "2017-09-10",
    "expected_leaving_port_date": "2017-09-11",
    "closest_wind_data_location": "COCOA BEACH FL",
    "culmulative_wind_34kt": "84%",
    "culmulative_wind_50kt": "31%",
    "34kt_max": "84%",
    "time_to_34kt_max": "48",
    "time_to_34kt_non_zero": "0",
    "time_to_50kt_max": "48",
    "gale_probability": {
      "in 12h": "8%",
      "in 24h": "53%",
      "in 48h": "84%",
      "in 72h": "84%",
      "in 96h": "84%"
    },
    "first_hazard": "Arrival of tropical storm-force winds",
    "rain_fall_above_4_inch": "Yes",
    "storm_surge_above_3_feet": "Yes",
    "wind": "Tropical-storm-force winds are likely (84% chance) with a 31% chance of sustained 50-kt winds; brief hurricane-force gusts possible as Irma passes inland to the west.",
    "storm_surge": "2–4 ft of surge possible along the Brevard coast, including Port Canaveral, per NHC surge table (Storm Surge Warning in effect).",
    "rainfall": "8–15 inches of rain possible across the Florida peninsula with isolated 20 inch totals; Port Canaveral could easily exceed 4 inches and experience flash flooding.",
    "other_hazards": "Dangerous rip currents, large surf, and the potential for isolated tornadoes in outer rain bands may disrupt port operations."
  }
}