{
  "cyclone": {
    "name": "IRMA",
    "category": "Category 3",
    "current_location": "about 145 mi SE of Key West, Florida",
    "coordinates": "23.1N, 80.2W",
    "motion": {
      "direction": "W",
      "speed": "9 mph"
    },
    "trajectory": "Moving west along the north coast of Cuba, forecast to turn northwest tonight and then north-northwest on Sunday, taking the center across the Florida Keys and up the southwest Florida coast before curving inland across south-central Georgia and the southeastern United States.",
    "expected_landfall_location": "Florida Keys and then the southwest coast of Florida",
    "expected_landfall_date": "2017-09-10",
    "hours_to_landfall": "18",
    "hours_to_offshore": "60",
    "hours_of_strike": "36"
  },
  "port": {
    "name": "Port of Brunswick, GA"
  },
  "weather_observation": {
    "within_uncertainty_cone": "Yes",
    "forecast_window": "5",
    "under_watch": "Hurricane Watch (also under Storm Surge Watch)",
    "under_warning": "None",
    "watch_coast": "Hurricane Watch north of Fernandina Beach, FL to Edisto Beach, SC; Storm Surge Watch north of the Volusia/Brevard County line, FL to Isle of Palms, SC",
    "warning_coast": "Hurricane Warning Fernandina Beach, FL southward around the Florida peninsula to the Aucilla River; Florida Keys (Port of Brunswick is just north of the warning limit)",
    "impacted_coast": "Entire Florida peninsula, Georgia and South Carolina coasts are expected to receive tropical-storm to hurricane-force winds, heavy rain and storm surge",
    "expected_closest_date_to_port": "2017-09-11",
    "expected_leaving_port_date": "2017-09-12",
    "closest_wind_data_location": "KINGS BAY GA",
    "culmulative_wind_34kt": "81%",
    "culmulative_wind_50kt": "35%",
    "34kt_max": "56%",
    "time_to_34kt_max": "42",
    "time_to_34kt_non_zero": "30",
    "time_to_50kt_max": "60",
    "gale_probability": {
      "in 12h": "0%",
      "in 24h": "0%",
      "in 48h": "62%",
      "in 72h": "81%",
      "in 96h": "81%"
    },
    "first_hazard": "Arrival of tropical storm-force winds",
    "rain_fall_above_4_inch": "Yes",
    "storm_surge_above_3_feet": "Yes",
    "wind": "High likelihood (81%) of sustained tropical-storm-force winds with a 35% chance of 50-kt winds between Monday and early Tuesday; gusts could exceed 60 mph on exposed areas.",
    "storm_surge": "NHC surge forecast calls for 4–6 ft of inundation above ground for the Georgia coast from Fernandina Beach, FL to Isle of Palms, SC, which includes Brunswick.",
    "rainfall": "8–15 inches of rain possible across southeast Georgia with isolated amounts up to 20 inches, producing flash-flood risk around the port.",
    "other_hazards": "Minor coastal flooding at high tide, dangerous surf/rip currents, possible embedded tornadoes in outer rain-bands, prolonged power outages and debris hazards that will hamper port operations."
  }
}