{
  "cyclone": {
    "name": "KAY",
    "category": "Category 1",
    "current_location": "about 325 mi (525 km) southwest of Manzanillo, Mexico and about 490 mi (790 km) south-southeast of the southern tip of Baja California",
    "coordinates": "16.0N, 108.1W",
    "motion": {
      "direction": "WNW",
      "speed": "10 mph"
    },
    "trajectory": "Kay is forecast to turn northwest on Tuesday and then move north-northwest parallel to the Baja California Peninsula, reaching the area just west of central Baja late Friday into Saturday and then continuing northwestward toward the offshore waters of southern California.",
    "expected_landfall_location": "No direct landfall currently forecast; closest approach is expected just west of central Baja California Peninsula",
    "expected_landfall_date": "2022-09-08",
    "hours_to_landfall": "60",
    "hours_to_offshore": "120",
    "hours_of_strike": "12"
  },
  "port": {
    "name": "Port of Long Beach, CA"
  },
  "weather_observation": {
    "within_uncertainty_cone": "No",
    "forecast_window": "5",
    "under_watch": "None",
    "under_warning": "None",
    "watch_coast": "Loreto southward to Cabo San Lucas, and Cabo San Lucas northward to Punta Abreojos (southern Baja California Peninsula)",
    "warning_coast": "None in effect",
    "impacted_coast": "South-western mainland Mexico and the Baja California Peninsula, with swell and surf expected to propagate northward into southern California and the Gulf of California by mid- to late-week.",
    "expected_closest_date_to_port": "2022-09-10",
    "expected_leaving_port_date": "2022-09-11",
    "closest_wind_data_location": "S CATALINA IS",
    "culmulative_wind_34kt": "3%",
    "culmulative_wind_50kt": "<1%",
    "34kt_max": "3%",
    "time_to_34kt_max": "120",
    "time_to_34kt_non_zero": "96",
    "time_to_50kt_max": "N/A",
    "gale_probability": {
      "in 12h": "0%",
      "in 24h": "0%",
      "in 48h": "0%",
      "in 72h": "0%",
      "in 96h": "1%"
    },
    "first_hazard": "Start of heavy rainfall",
    "rain_fall_above_4_inch": "No",
    "storm_surge_above_3_feet": "No",
    "wind": "Low probability (≤3%) of tropical-storm-force winds reaching the Port; breezy conditions possible late Friday-Saturday.",
    "storm_surge": "Large southerly swell and rough surf could cause minor coastal inundation but surge heights above 3 ft are not expected in Long Beach harbor.",
    "rainfall": "Tropical moisture may bring bands of showers with locally 1–2 inches of rain Friday night through Saturday, but totals ≥4 inches are unlikely.",
    "other_hazards": "Dangerous rip currents and very rough seas in the approaches to the port could disrupt pilot boarding and vessel scheduling late week."
  }
}