{
  "cyclone": {
    "name": "NICOLE",
    "category": "Tropical Storm",
    "current_location": "about 350 mi NE of the north-western Bahamas and 460 mi E of West Palm Beach, Florida",
    "coordinates": "27.8N, 72.7W",
    "motion": {
      "direction": "W",
      "speed": "9 mph"
    },
    "trajectory": "moving west toward the north-western Bahamas, expected to turn WNW across the Florida Peninsula, then curve NW–N toward southern Georgia and the U.S. Southeast coast",
    "expected_landfall_location": "east-central Florida coast (Boca Raton – Flagler/Volusia Co. line)",
    "expected_landfall_date": "2022-11-10",
    "hours_to_landfall": "36",
    "hours_to_offshore": "",
    "hours_of_strike": ""
  },
  "port": {
    "name": "Mobile, AL"
  },
  "weather_observation": {
    "within_uncertainty_cone": "No",
    "forecast_window": "5",
    "under_watch": "None",
    "under_warning": "None",
    "watch_coast": "Hurricane Watch: Hallandale Beach FL to Boca Raton FL and Flagler/Volusia Co. line FL to Ponte Vedra Beach FL; Tropical Storm Watch: Altamaha Sound GA to Savannah River GA and south of Hallandale Beach FL to north of Ocean Reef FL; north of Bonita Beach FL to the Ochlockonee River FL",
    "warning_coast": "Hurricane Warning: Boca Raton FL to Flagler/Volusia Co. line FL and portions of the north-western Bahamas; Tropical Storm Warning: Hallandale Beach FL to Boca Raton FL, Flagler/Volusia Co. line FL to Altamaha Sound GA, Lake Okeechobee, Andros, New Providence, Eleuthera",
    "impacted_coast": "Florida east coast, north-western Bahamas, and eventually portions of Georgia and the Carolinas; Gulf impacts confined mainly to Florida Big Bend and west-central FL coast",
    "expected_closest_date_to_port": "2022-11-11",
    "expected_leaving_port_date": "2022-11-12",
    "closest_wind_data_location": "PENSACOLA FL",
    "culmulative_wind_34kt": "4%",
    "culmulative_wind_50kt": "0%",
    "34kt_max": "3%",
    "time_to_34kt_max": "72",
    "time_to_34kt_non_zero": "48",
    "time_to_50kt_max": "",
    "gale_probability": {
      "in 12h": "0%",
      "in 24h": "0%",
      "in 48h": "1%",
      "in 72h": "3%",
      "in 96h": "0%"
    },
    "first_hazard": "Start of heavy rainfall",
    "rain_fall_above_4_inch": "No",
    "storm_surge_above_3_feet": "No",
    "wind": "Breezy to windy at times late Thursday into early Friday; tropical-storm-force winds are unlikely (≤4% chance).",
    "storm_surge": "None expected for Mobile Bay; surge focus is farther east along the Florida coast.",
    "rainfall": "Outer rainbands may bring light to moderate showers Thursday–Friday, generally under 2 inches.",
    "other_hazards": "Rough seas and higher swells in the north-central Gulf may affect vessel operations, but significant coastal hazards at Mobile, AL are not anticipated."
  }
}