{
  "cyclone": {
    "name": "NICOLE",
    "category": "Tropical Storm",
    "current_location": "about 25 miles ENE of Great Abaco Island, north-western Bahamas",
    "coordinates": "26.5N, 76.7W",
    "motion": {
      "direction": "W",
      "speed": "12 mph"
    },
    "trajectory": "Turning WNW tonight, then NW on Thursday, and north to north-northeast on Friday while crossing the Florida Peninsula, entering the northeastern Gulf briefly, and moving inland across Georgia and the Carolinas.",
    "expected_landfall_location": "east-central Florida coast (near or just north of West Palm Beach, FL)",
    "expected_landfall_date": "2022-11-10",
    "hours_to_landfall": "16",
    "hours_to_offshore": "24",
    "hours_of_strike": "12"
  },
  "port": {
    "name": "Mobile, AL"
  },
  "weather_observation": {
    "within_uncertainty_cone": "No",
    "forecast_window": "5",
    "under_watch": "None",
    "under_warning": "None",
    "watch_coast": "Hurricane Watch Hallandale Beach–Boca Raton FL and Lake Okeechobee; Storm Surge Watch Ochlockonee River–Indian Pass FL and N Palm Beach–Hallandale Beach FL; Tropical Storm Watch south of Hallandale Beach to north of Ocean Reef FL.",
    "warning_coast": "Hurricane Warning Abacos, Berry Is., Grand Bahama; Boca Raton–Flagler/Volusia Co. line FL.  Tropical Storm Warning Bimini; Hallandale Beach FL–South Santee River SC; north of Bonita Beach–Indian Pass FL.  Storm Surge Warning North Palm Beach FL–Altamaha Sound GA, St. Johns River, Anclote River–Ochlockonee River FL.",
    "impacted_coast": "North-western Bahamas, most of the Florida Peninsula (both Atlantic and portions of Gulf sides), Georgia and South Carolina coasts, with wind and surge extending into northeast Gulf of Mexico.",
    "expected_closest_date_to_port": "2022-11-10",
    "expected_leaving_port_date": "2022-11-11",
    "closest_wind_data_location": "DESTIN EXEC AP FL",
    "culmulative_wind_34kt": "5%",
    "culmulative_wind_50kt": "0%",
    "34kt_max": "5%",
    "time_to_34kt_max": "48",
    "time_to_34kt_non_zero": "24",
    "time_to_50kt_max": "",
    "gale_probability": {
      "in 12h": "0%",
      "in 24h": "1%",
      "in 48h": "5%",
      "in 72h": "5%",
      "in 96h": "5%"
    },
    "first_hazard": "Start of heavy rainfall",
    "rain_fall_above_4_inch": "No",
    "storm_surge_above_3_feet": "No",
    "wind": "Low (≤5%) chance of sustained 34-kt winds; breezy northeasterly gusts possible Thursday night–Friday.",
    "storm_surge": "None expected along the Alabama coast; surge focus remains east of the Big Bend.",
    "rainfall": "1–3 inches of rain possible Thursday night into Friday as the system’s western rain shield brushes southern Alabama.",
    "other_hazards": "Elevated seas and rip currents in the open Gulf; minor schedule disruptions from rain-bands."
  }
}