{
  "cyclone": {
    "name": "NICOLE",
    "category": "Subtropical Storm",
    "current_location": "about 415 mi ENE of the northwestern Bahamas",
    "coordinates": "27.0N, 71.1W",
    "motion": {
      "direction": "NW",
      "speed": "8 mph"
    },
    "trajectory": "Nicole is forecast to move west-southwest toward the north-western Bahamas on Tuesday, then continue westward to make landfall along Florida’s east-central coast Wednesday night before turning northwestward across the Florida Peninsula toward southern Georgia.",
    "expected_landfall_location": "east-central coast of Florida (around the Treasure Coast to Volusia/Brevard County line)",
    "expected_landfall_date": "2022-11-09",
    "hours_to_landfall": "36",
    "hours_to_offshore": "60",
    "hours_of_strike": "12"
  },
  "port": {
    "name": "Manatee County Port, FL"
  },
  "weather_observation": {
    "within_uncertainty_cone": "Yes",
    "forecast_window": "5",
    "under_watch": "None",
    "under_warning": "None",
    "watch_coast": "Hurricane Watch from Hallandale Beach FL northward to the Volusia/Brevard County Line; Storm Surge Watch North Palm Beach to Hallandale Beach",
    "warning_coast": "Tropical Storm Warning Hallandale Beach FL northward to Altamaha Sound GA including Lake Okeechobee; Storm Surge Warning North Palm Beach FL to Altamaha Sound GA including the St. Johns River",
    "impacted_coast": "NW Bahamas, entire east coast of Florida, interior Florida Peninsula (including west-central coast near Tampa Bay), and southeastern U.S. coastline northward into Georgia and the Carolinas",
    "expected_closest_date_to_port": "2022-11-10",
    "expected_leaving_port_date": "2022-11-11",
    "closest_wind_data_location": "TAMPA FL",
    "culmulative_wind_34kt": "59%",
    "culmulative_wind_50kt": "22%",
    "34kt_max": "59%",
    "time_to_34kt_max": "96",
    "time_to_34kt_non_zero": "36",
    "time_to_50kt_max": "96",
    "gale_probability": {
      "in 12h": "0%",
      "in 24h": "0%",
      "in 48h": "13%",
      "in 72h": "53%",
      "in 96h": "59%"
    },
    "first_hazard": "Arrival of tropical storm-force winds",
    "rain_fall_above_4_inch": "Yes",
    "storm_surge_above_3_feet": "No",
    "wind": "Tropical-storm-force winds (sustained 39–50 mph with higher gusts) are possible at Port Manatee late Wednesday night through Thursday as Nicole’s center passes just east-northeast.",
    "storm_surge": "No significant surge guidance issued for the west-central Gulf coast at this time; primary surge threat is along Florida’s Atlantic side.",
    "rainfall": "3–5 inches with locally higher amounts could fall across west-central Florida, producing periods of heavy rainfall and localized flooding around the port.",
    "other_hazards": "Large swells and rough seas spreading into Tampa Bay could disrupt vessel traffic and cargo operations; isolated tornadoes cannot be ruled out over the peninsula."
  }
}